RT-Thread/rt-thread/bsp/freescale/platform/devices/MK21DA5/include/MK21DA5_features.h
/* @brief HOST mode enabled */
#define FSL_FEATURE_USB_KHCI_HOST_ENABLED (1)
/* @brief OTG mode enabled */
#define FSL_FEATURE_USB_KHCI_OTG_ENABLED (1)
/* @brief Size of the USB dedicated RAM */
#define FSL_FEATURE_USB_KHCI_USB_RAM (0)
/* @brief Has KEEP_ALIVE_CTRL register */
#define FSL_FEATURE_USB_KHCI_KEEP_ALIVE_ENABLED (0)
/* @brief Has the Dynamic SOF threshold compare support */
#define FSL_FEATURE_USB_KHCI_DYNAMIC_SOF_THRESHOLD_COMPARE_ENABLED (0)
/* @brief Has the VBUS detect support */
#define FSL_FEATURE_USB_KHCI_VBUS_DETECT_ENABLED (0)
/* @brief Has the IRC48M module clock support */
#define FSL_FEATURE_USB_KHCI_IRC48M_MODULE_CLOCK_ENABLED (0)

/* WDOG module features */

/* @brief Watchdog is available. */
#define FSL_FEATURE_WDOG_HAS_WATCHDOG (1)
/* @brief Has Wait mode support. */
#define FSL_FEATURE_WDOG_HAS_WAITEN (1)

/* DAC module features */

#if defined(CPU_MK21DX128AVMC5) || defined(CPU_MK21DX256AVMC5) || defined(CPU_MK21DN512AVMC5)
    /* @brief Define the size of hardware buffer */
    #define FSL_FEATURE_DAC_BUFFER_SIZE (16)
    /* @brief Define whether the buffer supports watermark event detection or not. */
    #define FSL_FEATURE_DAC_HAS_WATERMARK_DETECTION (1)
    /* @brief Define whether the buffer supports watermark selection detection or not. */
    #define FSL_FEATURE_DAC_HAS_WATERMARK_SELECTION (1)
    /* @brief Define whether the buffer supports watermark event 1 word before buffer upper limit. */
    #define FSL_FEATURE_DAC_HAS_WATERMARK_1_WORD (1)
    /* @brief Define whether the buffer supports watermark event 2 words before buffer upper limit. */
    #define FSL_FEATURE_DAC_HAS_WATERMARK_2_WORDS (1)
    /* @brief Define whether the buffer supports watermark event 3 words before buffer upper limit. */
    #define FSL_FEATURE_DAC_HAS_WATERMARK_3_WORDS (1)
    /* @brief Define whether the buffer supports watermark event 4 words before buffer upper limit. */
    #define FSL_FEATURE_DAC_HAS_WATERMARK_4_WORDS (1)
    /* @brief Define whether FIFO buffer mode is available or not. */
    #define FSL_FEATURE_DAC_HAS_BUFFER_FIFO_MODE (1)
    /* @brief Define whether swing buffer mode is available or not.. */
    #define FSL_FEATURE_DAC_HAS_BUFFER_SWING_MODE (1)
#endif

/* VREF module features */

#if defined(CPU_MK21DX128AVMC5) || defined(CPU_MK21DX256AVMC5) || defined(CPU_MK21DN512AVMC5)
    /* @brief Has chop oscillator (bit TRM[CHOPEN]) */
    #define FSL_FEATURE_VREF_HAS_CHOP_OSC (1)
    /* @brief Has second order curvature compensation (bit SC[ICOMPEN]) */
    #define FSL_FEATURE_VREF_HAS_COMPENSATION (1)
    /* @brief Describes the set of SC[MODE_LV] bitfield values */
    #define FSL_FEATURE_VREF_MODE_LV_TYPE (1)
    /* @brief Module has also low reference (registers VREFL/VREFH) */
    #define FSL_FEATURE_VREF_HAS_LOW_REFERENCE (0)
#endif

#endif /* __FSL_MK21DA5_FEATURES_H__ */

/*******************************************************************************
 * EOF
 ******************************************************************************/
